# Data_Integration

# Adding attributes

In [1]:
# importing pandas as pd 
import pandas as pd
# Creating the DataFrame 
df = pd.DataFrame({'Date':['10/2/2011', '11/2/2011', '12/2/2011', '13/2/2011'],
 'Event':['Music', 'Poetry', 'Theatre', 'Comedy'],
 'Cost':[10000, 5000, 15000, 2000]})
# Print the dataframe 
print(df)

        Date    Event   Cost
0  10/2/2011    Music  10000
1  11/2/2011   Poetry   5000
2  12/2/2011  Theatre  15000
3  13/2/2011   Comedy   2000

In [2]:
#using apply function to create a new column
df['Discounted_Price'] = df.apply(lambda row: row.Cost * 0.9, axis = 1)
# Print the DataFrame after addition of new column
print(df)

        Date    Event   Cost  Discounted_Price
0  10/2/2011    Music  10000            9000.0
1  11/2/2011   Poetry   5000            4500.0
2  12/2/2011  Theatre  15000           13500.0
3  13/2/2011   Comedy   2000            1800.0

In [3]:
df = pd.DataFrame({'Name':['John','Ted','Dove','Brad','Rex'],
 'Salary':[44000, 35000, 75000, 20000,6000]})
# Print the dataframe 
print(df)

   Name  Salary
0  John   44000
1   Ted   35000
2  Dove   75000
3  Brad   20000
4   Rex    6000

In [5]:
def salary_stats(value):
 if value < 10000:
     return "very low"
 elif 10000 <= value < 25000:
     return "low"
 elif 25000 <= value < 40000:
     return "average"
 elif 40000 <= value < 50000:
     return "better"
 elif value >= 50000:
     return "very good"
 
df['salary_stats'] = df['Salary'].map(salary_stats)
df

   Name  Salary salary_stats
0  John   44000       better
1   Ted   35000      average
2  Dove   75000    very good
3  Brad   20000          low
4   Rex    6000     very low

In [10]:
import pandas as pd
data = pd.DataFrame({
 'Name' : ['A', 'B', 'C', 'D','E', 'F'],
 'Education' : ['High School', 'Masters', 'Doctorate', 'Bachelors','Masters','High School']})
data

  Name    Education
0    A  High School
1    B      Masters
2    C    Doctorate
3    D    Bachelors
4    E      Masters
5    F  High School

# Adding data objects- rows

In [11]:
df.loc[len(df.index)]=['Hruthvik', 15000, 'low']
df

       Name  Salary salary_stats
0      John   44000       better
1       Ted   35000      average
2      Dove   75000    very good
3      Brad   20000          low
4       Rex    6000     very low
5  Hruthvik   15000          low

# Combining two dataframes

In [13]:
import pandas as pd
d1 = {'Name': ['Pankaj', 'Meghna', 'Lisa'], 'Country': ['India', 'India', 'USA']}
df1 = pd.DataFrame(d1)
print('DataFrame 1:\n', df1,'\n')
df2 = pd.DataFrame({'ID': [1, 2, 3], 'Name': ['Pankaj', 'Anupam', 'Amit']})
print('DataFrame 2:\n', df2,'\n')
df3 = pd.DataFrame({'Name': ['Priya'], 'Country': ['India'], 'Role': ['COO']})
print('DataFrame 3:\n', df3,'\n')

DataFrame 1:
      Name Country
0  Pankaj   India
1  Meghna   India
2    Lisa     USA

DataFrame 2:
    ID    Name
0   1  Pankaj
1   2  Anupam
2   3    Amit

DataFrame 3:
     Name Country Role
0  Priya   India  COO

In [14]:
same_cols_df = pd.concat([df1,df3],ignore_index=True)
same_cols_df

     Name Country Role
0  Pankaj   India  NaN
1  Meghna   India  NaN
2    Lisa     USA  NaN
3   Priya   India  COO

In [15]:
a_df=df1.append(df2, ignore_index=True)
a_df

C:\Users\Language Lab\AppData\Local\Temp\ipykernel_11568\2048347772.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  a_df=df1.append(df2, ignore_index=True)

     Name Country   ID
0  Pankaj   India  NaN
1  Meghna   India  NaN
2    Lisa     USA  NaN
3  Pankaj     NaN  1.0
4  Anupam     NaN  2.0
5    Amit     NaN  3.0

In [16]:
c_df = pd.concat([df1,df2],ignore_index=True)
c_df

     Name Country   ID
0  Pankaj   India  NaN
1  Meghna   India  NaN
2    Lisa     USA  NaN
3  Pankaj     NaN  1.0
4  Anupam     NaN  2.0
5    Amit     NaN  3.0

# Data append

In [17]:
a_df=df1.append(df2, ignore_index=True)
a_df

C:\Users\Language Lab\AppData\Local\Temp\ipykernel_11568\2048347772.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  a_df=df1.append(df2, ignore_index=True)

     Name Country   ID
0  Pankaj   India  NaN
1  Meghna   India  NaN
2    Lisa     USA  NaN
3  Pankaj     NaN  1.0
4  Anupam     NaN  2.0
5    Amit     NaN  3.0